Truss top reference must be above the bottom reference.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TrussSwappedReferences { get; }
  Visual Basic
Public Shared ReadOnly Property TrussSwappedReferences As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TrussSwappedReferences {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace